Revit 2027 API
BuiltInFailures.LinkFailures.CannotUnlinkFile Property
 Can't unlink file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotUnlinkFile { get; }
Public Shared ReadOnly Property CannotUnlinkFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotUnlinkFile {
	FailureDefinitionId^ get ();
}
static member CannotUnlinkFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace